# GeoLocation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GeoLocation Property
ParameterTypeId Class See Also
---
"Shared Site"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GeoLocation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GeoLocation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GeoLocation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace